In [2]:
%load_ext sql
%sql sqlite:///Chinook_Sqlite.sqlite
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

Until the end of the Module 3 all the topics were standart but subquery, join and union concepts are hard to understand, so I made an extra note about them.

# Subquery

Use a **subquery** when you need to use the result of one query as a value in another. Think of it as a query within a query. A subquery is great for when you need to filter data based on a value that you don't know ahead of time, but you can find it with another SELECT statement.

Example: Find all customers who have made a purchase in 'USA'.

In [2]:
%%sql

SELECT FirstName, LastName
FROM Customer c
WHERE c.CustomerID IN (SELECT i.CustomerID FROM Invoice i WHERE BillingCountry = "USA")

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Frank', 'Harris'),
 ('Jack', 'Smith'),
 ('Michelle', 'Brooks'),
 ('Tim', 'Goyer'),
 ('Dan', 'Miller'),
 ('Kathy', 'Chase'),
 ('Heather', 'Leacock'),
 ('John', 'Gordon'),
 ('Frank', 'Ralston'),
 ('Victor', 'Stevens'),
 ('Richard', 'Cunningham'),
 ('Patrick', 'Gray'),
 ('Julia', 'Barnett')]

# Joins

Use a join when you need to combine columns from two or more tables into a single result set. This is the most common way to get related data from different tables.

**INNER JOIN**: Use this when you want to retrieve rows that have matching values in both tables. It's like finding the intersection between two sets of data.

Example: List the titles of all albums and the names of the artists who created them.

In [4]:
%%sql

SELECT Title, Name
FROM Album
INNER JOIN Artist ON Artist.ArtistID = Album.ArtistID
LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('Balls to the Wall', 'Accept'),
 ('Restless and Wild', 'Accept'),
 ('Let There Be Rock', 'AC/DC'),
 ('Big Ones', 'Aerosmith'),
 ('Jagged Little Pill', 'Alanis Morissette'),
 ('Facelift', 'Alice In Chains'),
 ('Warner 25 Anos', 'Antônio Carlos Jobim'),
 ('Plays Metallica By Four Cellos', 'Apocalyptica'),
 ('Audioslave', 'Audioslave')]

**LEFT JOIN**: Use this when you want to retrieve all rows from the left table and only the matching rows from the right table. If a row in the left table doesn't have a match in the right table, the columns from the right table will be NULL.

Example: List all albums, and if they have an associated artist, show the artist's name.

In [9]:
%%sql

SELECT Title, Name
FROM Album
LEFT JOIN Artist ON Album.ArtistID = Artist.ArtistID
LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('Balls to the Wall', 'Accept'),
 ('Restless and Wild', 'Accept'),
 ('Let There Be Rock', 'AC/DC'),
 ('Big Ones', 'Aerosmith'),
 ('Jagged Little Pill', 'Alanis Morissette'),
 ('Facelift', 'Alice In Chains'),
 ('Warner 25 Anos', 'Antônio Carlos Jobim'),
 ('Plays Metallica By Four Cellos', 'Apocalyptica'),
 ('Audioslave', 'Audioslave')]

# Unions

Use a union when you want to combine the results of two or more SELECT statements into a single column. The SELECT statements must have the same number of columns, and the corresponding columns must have similar data types. A UNION removes duplicate rows, while UNION ALL keeps them.

Example: Get a combined list of all artist names and all customer first names.

In [11]:
%%sql

SELECT Name FROM Artist
UNION
SELECT FirstName FROM Customer
LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('A Cor Do Som',),
 ('AC/DC',),
 ('Aaron',),
 ('Aaron Copland & London Symphony Orchestra',),
 ('Aaron Goldberg',),
 ('Academy of St. Martin in the Fields & Sir Neville Marriner',),
 ('Academy of St. Martin in the Fields Chamber Ensemble & Sir Neville Marriner',),
 ('Academy of St. Martin in the Fields, John Birch, Sir Neville Marriner & Sylvia McNair',),
 ('Academy of St. Martin in the Fields, Sir Neville Marriner & Thurston Dart',),
 ('Academy of St. Martin in the Fields, Sir Neville Marriner & William Bennett',)]

List the names of all employees who report to 'Nancy Edwards'.

In [13]:
%%sql

SELECT e1.FirstName,e1.LastName
FROM Employee e1
INNER JOIN Employee e2 ON e1.ReportsTo = e2.EmployeeID
WHERE e2.FirstName = "Nancy" AND e2.LastName = "Edwards"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Jane', 'Peacock'), ('Margaret', 'Park'), ('Steve', 'Johnson')]

Find the total number of tracks for each album.

In [18]:
%%sql

SELECT COUNT(Track.AlbumID) AS TotalNumberOfTracks, Album.Title
FROM Track
LEFT JOIN Album ON Album.AlbumID = Track.AlbumID
GROUP BY Album.AlbumID, Album.Title
LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(10, 'For Those About To Rock We Salute You'),
 (1, 'Balls to the Wall'),
 (3, 'Restless and Wild'),
 (8, 'Let There Be Rock'),
 (15, 'Big Ones'),
 (13, 'Jagged Little Pill'),
 (12, 'Facelift'),
 (14, 'Warner 25 Anos'),
 (8, 'Plays Metallica By Four Cellos'),
 (14, 'Audioslave')]

Display the names of all albums that have a track with the genre name 'Rock'.

In [21]:
%%sql

SELECT DISTINCT a.Title
FROM Album a
LEFT JOIN Track t ON a.AlbumID = t.AlbumID
LEFT JOIN Genre g ON t.GenreID = g.GenreID
WHERE g.Name  = "Rock"
LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('For Those About To Rock We Salute You',),
 ('Balls to the Wall',),
 ('Restless and Wild',),
 ('Let There Be Rock',),
 ('Big Ones',),
 ('Jagged Little Pill',),
 ('Facelift',),
 ('Audioslave',),
 ('BBC Sessions [Disc 1] [Live]',),
 ('Bongo Fury',)]

Get a list of all artists and all customers who live in 'Canada'. Include a column that indicates whether the name belongs to an 'Artist' or a 'Customer'.

In [25]:
%%sql

SELECT FirstName || " " || LastName AS FullName, "Customer" AS Type
FROM Customer
WHERE Country = "Canada"
UNION
SELECT FirstName || " " || LastName AS FullName, "Employee" AS Type
FROM Employee
WHERE Country = "Canada"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Aaron Mitchell', 'Customer'),
 ('Andrew Adams', 'Employee'),
 ('Edward Francis', 'Customer'),
 ('Ellie Sullivan', 'Customer'),
 ('François Tremblay', 'Customer'),
 ('Jane Peacock', 'Employee'),
 ('Jennifer Peterson', 'Customer'),
 ('Laura Callahan', 'Employee'),
 ('Margaret Park', 'Employee'),
 ('Mark Philips', 'Customer'),
 ('Martha Silk', 'Customer'),
 ('Michael Mitchell', 'Employee'),
 ('Nancy Edwards', 'Employee'),
 ('Robert Brown', 'Customer'),
 ('Robert King', 'Employee'),
 ('Steve Johnson', 'Employee')]

Find the names of all employees and the names of the customers they support, but only for customers who have an email address that contains the word 'gmail'.

In [26]:
%%sql

SELECT e.FirstName || " " || e.LastName AS EmployeeName, c.FirstName || " " || c.LastName AS SupportedCustomer, c.Email
From Employee e
LEFT JOIN Customer c ON c.SupportRepID = e.EmployeeID
WHERE c.Email LIKE "%gmail%"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Jane Peacock', 'François Tremblay', 'ftremblay@gmail.com'),
 ('Jane Peacock', 'Frank Ralston', 'fralston@gmail.com'),
 ('Jane Peacock', 'Phil Hughes', 'phil.hughes@gmail.com'),
 ('Margaret Park', 'Heather Leacock', 'hleacock@gmail.com'),
 ('Margaret Park', 'Dominique Lefebvre', 'dominiquelefebvre@gmail.com'),
 ('Steve Johnson', 'Helena Holý', 'hholy@gmail.com'),
 ('Steve Johnson', 'Julia Barnett', 'jubarnett@gmail.com'),
 ('Steve Johnson', 'Martha Silk', 'marthasilk@gmail.com')]

Find the names of all employees who have a direct report (meaning someone reports to them) and also have sold more than 50 total invoices. List the employee's full name, their total number of direct reports, and the total number of invoices they sold.

In [30]:
%%sql

SELECT e2.FirstName || " " || e2.LastName AS EmployeeName, COUNT(e1.ReportsTo) AS DirectReports, COUNT(i.CustomerID) AS InvoiceCount
FROM Employee e1
LEFT JOIN Employee e2 ON e1.ReportsTo = e2.EmployeeID
LEFT JOIN Customer c ON c.SupportRepID = e2.EmployeeID
LEFT JOIN Invoice i ON i.CustomerID = c.CustomerID
GROUP BY e2.EmployeeID
HAVING InvoiceCount > 50

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[]

List the titles of all albums that contain only 'Rock' and 'Pop' genres.

In [31]:
%%sql

SELECT a.Title
FROM Album a
LEFT JOIN Track t ON t.AlbumID = a.AlbumID
LEFT JOIN Genre g ON g.GenreID = t.GenreID
WHERE g.Name IN ("Rock","Pop")
GROUP BY a.AlbumID
HAVING COUNT(DISTINCT g.Name) = 2

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[]

Display a list of all artists. For each artist, show their name and the total number of tracks they have on the InvoiceLine table. If an artist has no tracks on any invoice, they should still be included in the list, with a count of 0. Order the result by the number of tracks sold, from most to least.

In [6]:
%%sql

SELECT ar.Name, COUNT(i.TrackID) AS NumberOfTracks
FROM Artist AS ar 
LEFT JOIN Album AS al ON al.ArtistID = ar.ArtistID
LEFT JOIN Track AS t ON t.AlbumID = al.AlbumID
LEFT JOIN InvoiceLine AS i ON i.TrackID = t.TrackID
GROUP BY ar.ArtistID
ORDER BY NumberOfTracks DESC
LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Iron Maiden', 140),
 ('U2', 107),
 ('Metallica', 91),
 ('Led Zeppelin', 87),
 ('Os Paralamas Do Sucesso', 45),
 ('Deep Purple', 44),
 ('Faith No More', 42),
 ('Lost', 41),
 ('Eric Clapton', 40),
 ('R.E.M.', 39)]

Find the names of all customers who have made a purchase in 'USA' and 'Canada'.

In [11]:
%%sql

SELECT DISTINCT c.FirstName || ' ' || c.LastName AS CustomerName
FROM Customer c
JOIN Invoice i1 ON c.CustomerId = i1.CustomerId AND i1.BillingCountry = 'USA'
JOIN Invoice i2 ON c.CustomerId = i2.CustomerId AND i2.BillingCountry = 'Canada';

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[]

List the artists who have at least one album, but do not have any tracks on the InvoiceLine table.

In [14]:
%%sql

SELECT ar.Name
FROM Artist AS ar 
LEFT JOIN Album AS al ON al.ArtistID = ar.ArtistID
LEFT JOIN Track AS t On t.AlbumID = al.AlbumID
LEFT JOIN InvoiceLine AS i ON i.TrackID = t.TrackID
GROUP BY ar.ArtistID
HAVING COUNT(i.TrackID) = 0 AND COUNT(al.AlbumID) > 0

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Cake',),
 ('Aisha Duo',),
 ('Karsh Kale',),
 ('Aaron Goldberg',),
 ('Nicolaus Esterhazy Sinfonia',),
 ('Alberto Turco & Nova Schola Gregoriana',),
 ('Richard Marlow & The Choir of Trinity College, Cambridge',),
 ('Anne-Sophie Mutter, Herbert Von Karajan & Wiener Philharmoniker',),
 ('Hilary Hahn, Jeffrey Kahane, Los Angeles Chamber Orchestra & Margaret Batjer',),
 ('Wilhelm Kempff',),
 ('Academy of St. Martin in the Fields Chamber Ensemble & Sir Neville Marriner',),
 ('Berliner Philharmoniker, Claudio Abbado & Sabine Meyer',),
 ('Orchestre Révolutionnaire et Romantique & John Eliot Gardiner',),
 ('Britten Sinfonia, Ivor Bolton & Lesley Garrett',),
 ('Chicago Symphony Chorus, Chicago Symphony Orchestra & Sir Georg Solti',),
 ('London Symphony Orchestra & Sir Charles Mackerras',),
 ('Barry Wordsworth & BBC Concert Orchestra',),
 ('Herbert Von Karajan, Mirella Freni & Wiener Philharmoniker',),
 ('Luciano Pavarotti',),
 ('Leonard Bernstein & New York Philharmonic',),
 ('Boston Symphony Orchestra & Seiji Ozawa',),
 ('Aaron Copland & London Symphony Orchestra',),
 ('Ton Koopman',),
 ('Sergei Prokofiev & Yuri Temirkanov',),
 ('James Levine',),
 ('Gustav Mahler',),
 ('Choir Of Westminster Abbey & Simon Preston',),
 ('Chor der Wiener Staatsoper, Herbert Von Karajan & Wiener Philharmoniker',),
 ('Sir Georg Solti, Sumi Jo & Wiener Philharmoniker',),
 ("Christopher O'Riley",),
 ('Fretwork',),
 ('Les Arts Florissants & William Christie',),
 ("Charles Dutoit & L'Orchestre Symphonique de Montréal",),
 ('Itzhak Perlman',),
 ('Gerald Moore',),
 ('Mela Tenenbaum, Pro Musica Prague & Richard Kapp',),
 ('C. Monteverdi, Nigel Rogers - Chiaroscuro; London Baroque; London Cornett & Sackbu',),
 ('Nash Ensemble',),
 ('Philip Glass Ensemble',)]